{"vllm":0,"code":1,"conduct":2,"our":3,"pledge":4,"we":5,"members":6,"contributors":7,"leaders":8,"make":9,"participation":10,"community":11,"harassment":12,"free":13,"experience":14,"everyone":15,"regardless":16,"age":17,"body":18,"size":19,"visible":20,"invisible":21,"disability":22,"ethnicity":23,"sex":24,"characteristics":25,"gender":26,"identity":27,"expression":28,"level":29,"education":30,"socioeconomic":31,"status":32,"nationality":33,"personal":34,"appearance":35,"race":36,"caste":37,"color":38,"religion":39,"sexual":40,"orientation":41,"act":42,"interact":43,"ways":44,"contribute":45,"open":46,"welcoming":47,"diverse":48,"inclusive":49,"healthy":50,"standards":51,"examples":52,"behavior":53,"contributes":54,"positive":55,"environment":56,"include":57,"demonstrating":58,"empathy":59,"kindness":60,"toward":61,"other":62,"people":63,"being":64,"respectful":65,"differing":66,"opinions":67,"viewpoints":68,"experiences":69,"giving":70,"gracefully":71,"accepting":72,"constructive":73,"feedback":74,"responsibility":75,"apologizing":76,"those":77,"affected":78,"mistakes":79,"learning":80,"from":81,"focusing":82,"what":83,"best":84,"just":85,"us":86,"individuals":87,"overall":88,"unacceptable":89,"use":90,"sexualized":91,"language":92,"imagery":93,"attention":94,"advances":95,"any":96,"kind":97,"trolling":98,"insulting":99,"derogatory":100,"comments":101,"political":102,"attacks":103,"public":104,"private":105,"publishing":106,"others":107,"information":108,"physical":109,"email":110,"address":111,"without":112,"explicit":113,"permission":114,"which":115,"could":116,"reasonably":117,"considered":118,"inappropriate":119,"professional":120,"setting":121,"enforcement":122,"responsibilities":123,"responsible":124,"clarifying":125,"enforcing":126,"acceptable":127,"take":128,"appropriate":129,"fair":130,"corrective":131,"action":132,"response":133,"deem":134,"threatening":135,"offensive":136,"harmful":137,"have":138,"right":139,"remove":140,"edit":141,"reject":142,"commits":143,"wiki":144,"edits":145,"issues":146,"contributions":147,"aligned":148,"communicate":149,"reasons":150,"moderation":151,"decisions":152,"when":153,"scope":154,"applies":155,"within":156,"all":157,"spaces":158,"also":159,"individual":160,"officially":161,"representing":162,"using":163,"official":164,"posting":165,"via":166,"social":167,"media":168,"account":169,"acting":170,"appointed":171,"representative":172,"online":173,"offline":174,"irl":175,"event":176,"instances":177,"abusive":178,"harassing":179,"otherwise":180,"may":181,"reported":182,"channel":183,"slack":184,"https":185,"ai":186,"complaints":187,"reviewed":188,"investigated":189,"promptly":190,"fairly":191,"obligated":192,"respect":193,"privacy":194,"security":195,"reporter":196,"incident":197,"guidelines":198,"follow":199,"impact":200,"determining":201,"consequences":202,"violation":203,"correction":204,"deemed":205,"unprofessional":206,"unwelcome":207,"consequence":208,"written":209,"warning":210,"providing":211,"clarity":212,"around":213,"nature":214,"explanation":215,"why":216,"apology":217,"requested":218,"through":219,"single":220,"series":221,"actions":222,"continued":223,"interaction":224,"involved":225,"including":226,"unsolicited":227,"specified":228,"period":229,"time":230,"includes":231,"avoiding":232,"interactions":233,"well":234,"external":235,"channels":236,"like":237,"violating":238,"terms":239,"lead":240,"temporary":241,"permanent":242,"ban":243,"serious":244,"sustained":245,"sort":246,"communication":247,"allowed":248,"during":249,"pattern":250,"aggression":251,"disparagement":252,"classes":253,"attribution":254,"adapted":255,"contributor":256,"covenant":257,"www":258,"org":259,"version":260,"available":261,"v2":262,"code_of_conduct":263,"html":264,"were":265,"inspired":266,"mozilla":267,"ladder":268,"github":269,"com":270,"inclusion":271,"answers":272,"common":273,"questions":274,"about":275,"see":276,"faq":277,"translations":278,"spdx":279,"license":280,"identifier":281,"apache":282,"filecopyrighttext":283,"copyright":284,"project":285,"import":286,"ctypes":287,"importlib":288,"util":289,"json":290,"logging":291,"os":292,"re":293,"shutil":294,"subprocess":295,"sys":296,"pathlib":297,"path":298,"torch":299,"packaging":300,"parse":301,"setuptools":302,"extension":303,"setup":304,"command":305,"build_ext":306,"setuptools_scm":307,"get_version":308,"utils":309,"cpp_extension":310,"cuda_home":311,"rocm_home":312,"def":313,"load_module_from_path":314,"module_name":315,"spec":316,"spec_from_file_location":317,"module":318,"module_from_spec":319,"modules":320,"loader":321,"exec_module":322,"return":323,"root_dir":324,"__file__":325,"parent":326,"logger":327,"getlogger":328,"__name__":329,"cannot":330,"envs":331,"directly":332,"because":333,"depends":334,"installed":335,"yet":336,"join":337,"py":338,"vllm_target_device":339,"platform":340,"startswith":341,"darwin":342,"cpu":343,"automatically":344,"set":345,"due":346,"macos":347,"elif":348,"linux":349,"only":350,"supports":351,"wsl":352,"building":353,"so":354,"able":355,"run":356,"correctly":357,"empty":358,"cuda":359,"none":360,"getenv":361,"hip":362,"fallback":363,"main_cuda_version":364,"12":365,"is_sccache_available":366,"bool":367,"sccache":368,"int":369,"vllm_disable_sccache":370,"is_ccache_available":371,"ccache":372,"is_ninja_available":373,"ninja":374,"is_url_available":375,"url":376,"str":377,"urllib":378,"request":379,"urlopen":380,"try":381,"except":382,"exception":383,"false":384,"200":385,"class":386,"cmakeextension":387,"__init__":388,"self":389,"name":390,"cmake_lists_dir":391,"kwa":392,"super":393,"sources":394,"py_limited_api":395,"true":396,"abspath":397,"cmake_build_ext":398,"dict":399,"directories":400,"been":401,"configured":402,"did_config":403,"determine":404,"number":405,"compilation":406,"jobs":407,"optionally":408,"nvcc":409,"compile":410,"threads":411,"compute_num_jobs":412,"num_jobs":413,"either":414,"value":415,"max_jobs":416,"variable":417,"defined":418,"cpus":419,"info":420,"else":421,"sched_getaffinity":422,"isn":423,"universally":424,"fall":425,"back":426,"cpu_count":427,"get":428,"error":429,"here":430,"len":431,"attributeerror":432,"nvcc_threads":433,"_is_cuda":434,"get_nvcc_cuda_version":435,"11":436,"reduce":437,"avoid":438,"overloading":439,"system":440,"max":441,"perform":442,"cmake":443,"configuration":444,"configure":445,"ext":446,"ve":447,"already":448,"cmakelists":449,"txt":450,"exit":451,"early":452,"select":453,"build":454,"type":455,"note":456,"optimization":457,"debug":458,"default_cfg":459,"relwithdebinfo":460,"cfg":461,"cmake_build_type":462,"cmake_args":463,"dcmake_build_type":464,"format":465,"dvllm_target_device":466,"verbose":467,"dcmake_verbose_makefile":468,"dcmake_c_compiler_launcher":469,"dcmake_cxx_compiler_launcher":470,"dcmake_cuda_compiler_launcher":471,"dcmake_hip_compiler_launcher":472,"pass":473,"python":474,"executable":475,"can":476,"find":477,"exact":478,"match":479,"dvllm_python_executable":480,"reuse":481,"dependencies":482,"subsequent":483,"calls":484,"dvllm_python_path":485,"override":486,"base":487,"directory":488,"fetchcontent":489,"downloads":490,"root":491,"deps":492,"allows":493,"sharing":494,"between":495,"profiles":496,"plays":497,"more":498,"nicely":499,"fetchcontent_base_dir":500,"fc_base_dir":501,"environ":502,"dfetchcontent_base_dir":503,"parallelism":504,"tool":505,"dnvcc_threads":506,"build_tool":507,"dcmake_job_pool_compile":508,"string":509,"dcmake_job_pools":510,"default":511,"whatever":512,"picks":513,"sure":514,"dcmake_cuda_compiler":515,"bin":516,"check_call":517,"cwd":518,"build_temp":519,"build_extensions":520,"ensure":521,"present":522,"working":523,"check_output":524,"oserror":525,"raise":526,"runtimeerror":527,"create":528,"does":529,"exist":530,"exists":531,"makedirs":532,"targets":533,"target_name":534,"removeprefix":535,"vllm_flash_attn":536,"extensions":537,"append":538,"build_args":539,"target":540,"install":541,"libraries":542,"proper":543,"location":544,"outdir":545,"get_ext_fullpath":546,"absolute":547,"skip":548,"same":549,"continue":550,"appends":551,"prefix":552,"contains":553,"need":554,"range":555,"count":556,"should":557,"actually":558,"components":559,"install_args":560,"component":561,"first":562,"standard":563,"copy":564,"build_lib":565,"current":566,"included":567,"editable":568,"glob":569,"files":570,"recursive":571,"file":572,"dst_file":573,"split":574,"print":575,"copying":576,"dirname":577,"exist_ok":578,"copy_file":579,"precompiled_build_ext":580,"disables":581,"precompiled":582,"binaries":583,"assert":584,"vllm_use_precompiled":585,"supported":586,"builds":587,"skipping":588,"precompiled_wheel_utils":589,"extracts":590,"existing":591,"wheel":592,"staticmethod":593,"extract_precompiled_and_patch_package":594,"wheel_url_or_path":595,"tempfile":596,"zipfile":597,"temp_dir":598,"isfile":599,"wheel_filename":600,"mkdtemp":601,"wheels":602,"wheel_path":603,"downloading":604,"urlretrieve":605,"filename":606,"package_data_patch":607,"files_to_copy":608,"_c":609,"abi3":610,"_moe_c":611,"_flashmla_c":612,"_vllm_fa2_c":613,"_vllm_fa3_c":614,"cumem_allocator":615,"compiled_regex":616,"file_members":617,"list":618,"filter":619,"lambda":620,"filelist":621,"extract":622,"target_path":623,"src":624,"wb":625,"dst":626,"copyfileobj":627,"pkg":628,"replace":629,"setdefault":630,"basename":631,"finally":632,"removing":633,"rmtree":634,"get_base_commit_in_main_branch":635,"force":636,"nightly":637,"mainly":638,"used":639,"ci":640,"testing":641,"vllm_test_use_precompiled_nightly_wheel":642,"latest":643,"commit":644,"hash":645,"upstream":646,"main":647,"branch":648,"resp_json":649,"curl":650,"api":651,"repos":652,"decode":653,"utf":654,"upstream_main_commit":655,"loads":656,"sha":657,"docker":658,"context":659,"git":660,"immutable":661,"missing":662,"vllm_docker_build_context":663,"check":664,"local":665,"repo":666,"cat":667,"calledprocesserror":668,"fetch":669,"remote":670,"repository":671,"update":672,"branches":673,"ensures":674,"ref":675,"its":676,"history":677,"current_branch":678,"show":679,"strip":680,"base_commit":681,"merge":682,"valueerror":683,"err":684,"failed":685,"compatible":686,"your":687,"dev":688,"_no_device":689,"has_cuda":690,"_is_neuron":691,"_is_tpu":692,"_is_hip":693,"rocm":694,"neuron":695,"tpu":696,"_is_cpu":697,"_is_xpu":698,"xpu":699,"_build_custom_ops":700,"get_rocm_version":701,"librocm":702,"core":703,"blob":704,"d11f5c20d500f729c393680a01fa902ebf92094b":705,"rocm_version":706,"cpp":707,"l21":708,"librocm_core_file":709,"lib":710,"is_file":711,"librocm_core":712,"cdll":713,"vererrors":714,"c_uint32":715,"get_rocm_core_version":716,"getrocmversion":717,"restype":718,"argtypes":719,"pointer":720,"major":721,"minor":722,"patch":723,"byref":724,"get_neuronxcc_version":725,"sysconfig":726,"site_dir":727,"get_paths":728,"purelib":729,"version_file":730,"neuronxcc":731,"executed":732,"successfully":733,"fp":734,"content":735,"read":736,"regular":737,"search":738,"__version__":739,"group":740,"output":741,"nvidia":742,"apex":743,"8b7a1ff183741dd8f9b87e7bafd04cfde99cea28":744,"nvcc_output":745,"universal_newlines":746,"release_idx":747,"index":748,"release":749,"nvcc_cuda_version":750,"get_gaudi_sw_version":751,"returns":752,"driver":753,"enable":754,"console":755,"printing":756,"hl":757,"smi":758,"shell":759,"text":760,"capture_output":761,"env":762,"enable_console":763,"returncode":764,"stdout":765,"get_vllm_version":766,"write_to":767,"_version":768,"sep":769,"versions":770,"might":771,"contain":772,"cuda_version":773,"cuda_version_str":774,"source":775,"tarball":776,"required":777,"pypi":778,"sdist":779,"argv":780,"cu":781,"neuron_version":782,"neuron_version_str":783,"unknown":784,"runtime":785,"get_requirements":786,"package":787,"requirements":788,"requirements_dir":789,"_read_requirements":790,"resolved_requirements":791,"line":792,"cuda_major":793,"cuda_minor":794,"modified_requirements":795,"req":796,"flash":797,"attn":798,"built":799,"unsupported":800,"please":801,"ext_modules":802,"_rocm_c":803,"fa3":804,"requires":805,"later":806,"optional":807,"since":808,"doesn":809,"produce":810,"targeting":811,"hopper":812,"package_data":813,"typed":814,"model_executor":815,"layers":816,"fused_moe":817,"configs":818,"quantization":819,"advance":820,"wheel_location":821,"vllm_precompiled_wheel_location":822,"wheel_url":823,"cp38":824,"manylinux1_x86_64":825,"whl":826,"resp":827,"warn":828,"falling":829,"items":830,"extend":831,"cmdclass":832,"static":833,"metadata":834,"rather":835,"go":836,"pyproject":837,"toml":838,"install_requires":839,"extras_require":840,"bench":841,"pandas":842,"datasets":843,"tensorizer":844,"10":845,"fastsafetensors":846,"runai":847,"model":848,"streamer":849,"13":850,"s3":851,"boto3":852,"audio":853,"librosa":854,"soundfile":855,"mistral_common":856,"processing":857,"video":858,"kept":859,"backwards":860,"compatibility":861,"flashinfer":862,"updated":863,"together":864,"dockerfile":865,"requires_files":866,"cleaning":867,"lines":868,"readlines":869,"lower":870,"removed":871,"write":872,"done":873,"traceback":874,"typing":875,"callable":876,"unittest":877,"mock":878,"find_cuda_init":879,"fn":880,"object":881,"helper":882,"function":883,"initialization":884,"errors":885,"initializes":886,"prints":887,"stack":888,"trace":889,"how":890,"happens":891,"_lazy_init":892,"wrapper":893,"nonlocal":894,"extract_stack":895,"initialized":896,"format_list":897,"__main__":898,"import_module":899,"models":900,"llava":901,"markdownlint":902,"disable":903,"md001":904,"md041":905,"align":906,"center":907,"picture":908,"prefers":909,"scheme":910,"dark":911,"srcset":912,"raw":913,"githubusercontent":914,"docs":915,"assets":916,"logos":917,"logo":918,"png":919,"img":920,"alt":921,"light":922,"width":923,"55":924,"h3":925,"easy":926,"fast":927,"cheap":928,"llm":929,"serving":930,"href":931,"documentation":932,"blog":933,"arxiv":934,"abs":935,"2309":936,"06180":937,"paper":938,"vllm_project":939,"twitter":940,"discuss":941,"user":942,"forum":943,"developer":944,"news":945,"2025":946,"08":947,"hosted":948,"beijing":949,"meetup":950,"mp":951,"weixin":952,"qq":953,"dgkwg1wfpwgo2jcdtqqhxa":954,"large":955,"scale":956,"deployment":957,"slides":958,"drive":959,"google":960,"folders":961,"1pid6nsflu43dzri0eatcpgxsazdvbbqf":962,"recording":963,"chaspark":964,"live":965,"1166916873711665152":966,"05":967,"nyc":968,"lu":969,"ma":970,"c1rqyf1f":971,"presentation":972,"1_q_aw_iomjwuimf1s1ym":973,"zhjxz8cuel0ijvaquoybea":974,"usp":975,"now":976,"under":977,"pytorch":978,"foundation":979,"announcement":980,"welcomes":981,"01":982,"excited":983,"announce":984,"alpha":985,"v1":986,"architectural":987,"upgrade":988,"7x":989,"speedup":990,"clean":991,"optimized":992,"execution":993,"loop":994,"zero":995,"overhead":996,"caching":997,"enhanced":998,"multimodal":999,"support":1000,"out":1001,"post":1002,"27":1003,"details":1004,"summary":1005,"previous":1006,"04":1007,"asia":1008,"day":1009,"sginnovate":1010,"limited":1011,"availability":1012,"morning":1013,"evening":1014,"slots":1015,"remaining":1016,"inaugural":1017,"team":1018,"19cp6qu8u48ihb91a064xfaxrunyiboukrbxamdolloo":1019,"03":1020,"ollama":1021,"inference":1022,"night":1023,"16t2pdd1ywrnz4tu8q5r6n53c5lr5c73uv9vd2_ebo4u":1024,"china":1025,"n77gibl2coratqhtveazfg":1026,"1rehvfqmkgnvz6p3fd23hhso4c8j5wpgzv0bkylwnhyq":1027,"east":1028,"coast":1029,"7mu4k4xx":1030,"1nhiv8euff1nld3feyodm56ndml26leexcadgydltsrs":1031,"slide":1032,"id":1033,"g31441846c39_0_0":1034,"02":1035,"ninth":1036,"h7g3kuj9":1037,"meta":1038,"1jzc_pzvxrvnsfvcw":1039,"v4cfxb6pn7zz2cyp_flwo05aqg":1040,"amd":1041,"1zk5qejiktmlq2eqcxqzlljax3m9s7nwn":1042,"view":1043,"posted":1044,"eighth":1045,"zep56hui":1046,"cloud":1047,"1epvkt4zu8jz_s5ohehpc798emsyh2bwyfruddvef7u4":1048,"1h24phewanyrl11xy5dxubvrc9f9kkjix":1049,"2024":1050,"joins":1051,"ecosystem":1052,"seventh":1053,"h0qvrajz":1054,"snowflake":1055,"1e3cxqbv3jsfgp30swyvs3em_tw":1056,"ghohj9pajgk6kr54":1057,"1qf3rkdaboulwz9wk5toltt2fe9t6uic_hvnlfaaqx6a":1058,"created":1059,"coordinating":1060,"discussing":1061,"features":1062,"feel":1063,"ray":1064,"summit":1065,"held":1066,"special":1067,"track":1068,"opening":1069,"talk":1070,"1b_kqxphbtra_mdf":1071,"tr6i8rwdou5qotznceg2mkzxehm":1072,"learn":1073,"talks":1074,"youtube":1075,"playlist":1076,"plztswpqnepxl6aqwifuwuimlpfrvpksjr":1077,"users":1078,"09":1079,"sixth":1080,"87q3nvnh":1081,"1wrlgwytqfaotd5wcgspnhoaw3nq0e":1082,"9wqyp7ny93xrs":1083,"07":1084,"fifth":1085,"lp0gyjqr":1086,"aws":1087,"1rgud8acfchocghop3zmxzck9vx3rci9yfuab2bbcl4y":1088,"partnership":1089,"llama":1090,"fp8":1091,"pipeline":1092,"23":1093,"llama31":1094,"06":1095,"fourth":1096,"agivllm":1097,"cloudflare":1098,"bentoml":1099,"1ij8o7v2bqei0bfeljltwc5g1s10_rhv3beed5ob0nj4":1100,"third":1101,"robloxandvllmmeetup2024":1102,"splashthat":1103,"roblox":1104,"1a":1105,"47jak4bj39t954hytkvtfwn0fkqtsl8ngfuslrem":1106,"second":1107,"ygxbpzhl":1108,"ibm":1109,"12mi2skabnuw5rbwxdyy":1110,"hthth4imsnceoq10jdqbxga":1111,"2023":1112,"a16z":1113,"1ql":1114,"xpfxifpdbh86dbeegfxbxfxjix4v032ghshbkf3s":1115,"would":1116,"express":1117,"sincere":1118,"gratitude":1119,"andreessen":1120,"horowitz":1121,"30":1122,"supporting":1123,"generous":1124,"grant":1125,"development":1126,"research":1127,"released":1128,"fastchat":1129,"integration":1130,"has":1131,"powered":1132,"lmsys":1133,"vicuna":1134,"chatbot":1135,"arena":1136,"chat":1137,"mid":1138,"april":1139,"library":1140,"originally":1141,"developed":1142,"sky":1143,"computing":1144,"lab":1145,"cs":1146,"berkeley":1147,"edu":1148,"uc":1149,"evolved":1150,"driven":1151,"both":1152,"academia":1153,"industry":1154,"state":1155,"art":1156,"throughput":1157,"efficient":1158,"management":1159,"key":1160,"memory":1161,"pagedattention":1162,"20":1163,"continuous":1164,"batching":1165,"incoming":1166,"requests":1167,"graph":1168,"quantizations":1169,"gptq":1170,"2210":1171,"17323":1172,"awq":1173,"2306":1174,"00978":1175,"autoround":1176,"05516":1177,"int4":1178,"int8":1179,"kernels":1180,"flashattention":1181,"speculative":1182,"decoding":1183,"chunked":1184,"prefill":1185,"flexible":1186,"seamless":1187,"popular":1188,"hugging":1189,"face":1190,"high":1191,"various":1192,"algorithms":1193,"parallel":1194,"sampling":1195,"beam":1196,"tensor":1197,"data":1198,"expert":1199,"distributed":1200,"streaming":1201,"outputs":1202,"openai":1203,"server":1204,"gpus":1205,"intel":1206,"powerpc":1207,"multi":1208,"lora":1209,"seamlessly":1210,"most":1211,"huggingface":1212,"transformer":1213,"llms":1214,"mixture":1215,"mixtral":1216,"deepseek":1217,"v3":1218,"embedding":1219,"e5":1220,"mistral":1221,"modal":1222,"full":1223,"en":1224,"supported_models":1225,"getting":1226,"started":1227,"pip":1228,"getting_started":1229,"installation":1230,"gpu":1231,"bash":1232,"visit":1233,"quickstart":1234,"contributing":1235,"welcome":1236,"collaborations":1237,"sponsors":1238,"compute":1239,"resources":1240,"following":1241,"organizations":1242,"thank":1243,"you":1244,"them":1245,"alphabetical":1246,"order":1247,"keep":1248,"consistent":1249,"md":1250,"cash":1251,"donations":1252,"dropbox":1253,"sequoia":1254,"capital":1255,"skywork":1256,"zhenfund":1257,"alibaba":1258,"anyscale":1259,"crusoe":1260,"databricks":1261,"deepinfra":1262,"nebius":1263,"novita":1264,"replicate":1265,"runpod":1266,"trainy":1267,"san":1268,"diego":1269,"sponsor":1270,"fundraising":1271,"venue":1272,"opencollective":1273,"plan":1274,"fund":1275,"maintenance":1276,"adoption":1277,"citation":1278,"cite":1279,"bibtex":1280,"inproceedings":1281,"kwon2023efficient":1282,"title":1283,"author":1284,"woosuk":1285,"kwon":1286,"zhuohan":1287,"li":1288,"siyuan":1289,"zhuang":1290,"ying":1291,"sheng":1292,"lianmin":1293,"zheng":1294,"cody":1295,"hao":1296,"yu":1297,"joseph":1298,"gonzalez":1299,"zhang":1300,"ion":1301,"stoica":1302,"booktitle":1303,"proceedings":1304,"acm":1305,"sigops":1306,"29th":1307,"symposium":1308,"operating":1309,"systems":1310,"principles":1311,"year":1312,"contact":1313,"start":1314,"technical":1315,"feature":1316,"fellow":1317,"disclosures":1318,"advisories":1319,"partnerships":1320,"lists":1321,"mailto":1322,"end":1323,"kit":1324,"wish":1325,"refer":1326,"policy":1327,"reporting":1328,"report":1329,"privately":1330,"vulnerability":1331,"submission":1332,"form":1333,"new":1334,"issue":1335,"triage":1336,"reports":1337,"triaged":1338,"vulnerability_management":1339,"threat":1340,"guide":1341,"usage":1342,"assumptions":1343,"recommendations":1344,"securely":1345,"severity":1346,"risk":1347,"each":1348,"taking":1349,"dealing":1350,"past":1351,"defaults":1352,"cases":1353,"categories":1354,"critical":1355,"vulnerabilities":1356,"allow":1357,"attackers":1358,"execute":1359,"arbitrary":1360,"control":1361,"significantly":1362,"compromise":1363,"confidentiality":1364,"integrity":1365,"privileges":1366,"needed":1367,"network":1368,"deserialization":1369,"exploit":1370,"chains":1371,"generally":1372,"rated":1373,"cvss":1374,"flaws":1375,"elevated":1376,"rce":1377,"specific":1378,"contexts":1379,"significant":1380,"loss":1381,"require":1382,"advanced":1383,"conditions":1384,"some":1385,"trust":1386,"modes":1387,"node":1388,"where":1389,"privileged":1390,"access":1391,"typically":1392,"scores":1393,"moderate":1394,"cause":1395,"denial":1396,"service":1397,"partial":1398,"disruption":1399,"do":1400,"breach":1401,"rating":1402,"low":1403,"informational":1404,"non":1405,"exploitable":1406,"weaknesses":1407,"privilege":1408,"offer":1409,"negligible":1410,"side":1411,"collisions":1412,"often":1413,"less":1414,"than":1415,"prenotification":1416,"certain":1417,"prenotify":1418,"vendors":1419,"ship":1420,"purpose":1421,"coordinated":1422,"fixes":1423,"severe":1424,"notification":1425,"adding":1426,"contacts":1427,"advisory":1428,"few":1429,"days":1430,"before":1431,"added":1432,"send":1433,"vendor":1434,"analyzed":1435,"case":1436,"basis":1437,"withdraw":1438,"receiving":1439,"future":1440,"prenotifications":1441,"membership":1442,"change":1443,"based":1444,"refinements":1445,"who":1446,"releasing":1447,"releases":1448,"reliable":1449,"packaged":1450,"binary":1451,"conveniently":1452,"accessed":1453,"serve":1454,"milestones":1455,"newly":1456,"improvements":1457,"upcoming":1458,"changes":1459,"affect":1460,"potential":1461,"breaking":1462,"versioning":1463,"uses":1464,"shifted":1465,"every":1466,"weeks":1467,"bug":1468,"opposed":1469,"semver":1470,"made":1471,"post1":1472,"_major_":1473,"milestone":1474,"incompatible":1475,"similar":1476,"_minor_":1477,"_patch_":1478,"_post1_":1479,"_patch":1480,"1_":1481,"implicit":1482,"cadence":1483,"bi":1484,"weekly":1485,"after":1486,"dates":1487,"below":1488,"tentative":1489,"date":1490,"jan":1491,"feb":1492,"mar":1493,"apr":1494,"jun":1495,"jul":1496,"aug":1497,"14":1498,"15":1499,"16":1500,"17":1501,"oct":1502,"18":1503,"19":1504,"nov":1505,"21":1506,"dec":1507,"22":1508,"dedicated":1509,"cut":1510,"performed":1511,"previously":1512,"reused":1513,"triggered":1514,"push":1515,"rc":1516,"tag":1517,"vx":1518,"rc1":1519,"enables":1520,"test":1521,"multiple":1522,"rcs":1523,"final":1524,"trigger":1525,"notes":1526,"monitor":1527,"reverts":1528,"apply":1529,"cherry":1530,"pick":1531,"criteria":1532,"approach":1533,"finalizing":1534,"clear":1535,"process":1536,"land":1537,"pr":1538,"sufficient":1539,"complete":1540,"thorough":1541,"round":1542,"stable":1543,"regression":1544,"functional":1545,"performance":1546,"against":1547,"recent":1548,"silent":1549,"incorrectness":1550,"crashes":1551,"deadlocks":1552,"leaks":1553,"introduced":1554,"identifiers":1555,"work":1556,"prs":1557,"merged":1558,"trunk":1559,"manual":1560,"validations":1561,"e2e":1562,"validation":1563,"regressions":1564,"benchmark":1565,"workflow":1566,"workflows":1567,"yml":1568,"coverage":1569,"llama3":1570,"llama4":1571,"hardware":1572,"h100":1573,"mi300x":1574,"_note":1575,"availability_":1576,"step":1577,"review":1578,"familiarize":1579,"yourself":1580,"configurations":1581,"tree":1582,"benchmarks":1583,"navigate":1584,"v0":1585,"results":1586,"once":1587,"completes":1588,"dashboard":1589,"hud":1590,"reponame":1591,"2fvllm":1592,"corresponding":1593,"comparison":1594,"compare":1595,"verify":1596,"occurred":1597,"example":1598,"vs":1599,"starttime":1600,"thu":1601,"2c":1602,"2017":1603,"20apr":1604,"202025":1605,"2021":1606,"3a43":1607,"3a50":1608,"20gmt":1609,"stoptime":1610,"wed":1611,"2016":1612,"20jul":1613,"granularity":1614,"week":1615,"lbranch":1616,"lcommit":1617,"b6553be1bc75f046b00046a4ad7576364d03c835":1618,"rbranch":1619,"rcommit":1620,"a5dd03c1ebc5e4f56f3c9d3dc0436e9c582c978f":1621,"benchmarkname":1622,"modelname":1623,"20models":1624,"backendname":1625,"20backends":1626,"modename":1627,"20modes":1628,"dtypename":1629,"20dtype":1630,"devicename":1631,"20devices":1632,"archname":1633,"20platforms":1634,"entrypoints":1635,"cli":1636,"vllm_main":1637,"init_logger":1638,"move":1639,"scripts":1640,"deprecated":1641,"instead":1642,"engine":1643,"independent":1644,"always":1645,"assumption":1646,"customization":1647,"__version_tuple__":1648,"isort":1649,"variables":1650,"imported":1651,"env_override":1652,"noqa":1653,"f401":1654,"module_attrs":1655,"asyncengineargs":1656,"arg_utils":1657,"engineargs":1658,"asyncllmengine":1659,"async_llm_engine":1660,"llmengine":1661,"llm_engine":1662,"initialize_ray_cluster":1663,"executor":1664,"ray_utils":1665,"prompttype":1666,"inputs":1667,"textprompt":1668,"tokensprompt":1669,"modelregistry":1670,"samplingparams":1671,"sampling_params":1672,"poolingparams":1673,"pooling_params":1674,"classificationoutput":1675,"classificationrequestoutput":1676,"completionoutput":1677,"embeddingoutput":1678,"embeddingrequestoutput":1679,"poolingoutput":1680,"poolingrequestoutput":1681,"requestoutput":1682,"scoringoutput":1683,"scoringrequestoutput":1684,"type_checking":1685,"__getattr__":1686,"attr_name":1687,"__package__":1688,"getattr":1689,"attribute":1690,"__all__":1691,"collections":1692,"abc":1693,"mutablesequence":1694,"sequence":1695,"genericsequence":1696,"dataclasses":1697,"dataclass":1698,"generic":1699,"union":1700,"typing_extensions":1701,"typevar":1702,"lorarequest":1703,"multimodalplaceholderdict":1704,"requestoutputkind":1705,"promptlogprobs":1706,"requestmetrics":1707,"samplelogprobs":1708,"sequencegroup":1709,"sequencegroupbase":1710,"sequencestatus":1711,"one":1712,"completion":1713,"args":1714,"generated":1715,"token_ids":1716,"token":1717,"ids":1718,"cumulative_logprob":1719,"cumulative":1720,"log":1721,"probability":1722,"logprobs":1723,"probabilities":1724,"top":1725,"words":1726,"position":1727,"finish_reason":1728,"reason":1729,"finished":1730,"stop_reason":1731,"stop":1732,"caused":1733,"encountering":1734,"eos":1735,"lora_request":1736,"generate":1737,"float":1738,"__repr__":1739,"pooling":1740,"extracted":1741,"hidden":1742,"states":1743,"__eq__":1744,"isinstance":1745,"__class__":1746,"request_id":1747,"unique":1748,"prompt":1749,"encoder":1750,"decoder":1751,"input":1752,"prompt_token_ids":1753,"prompt_logprobs":1754,"per":1755,"sequences":1756,"whether":1757,"whole":1758,"metrics":1759,"associated":1760,"encoder_prompt":1761,"encoder_prompt_token_ids":1762,"num_cached_tokens":1763,"tokens":1764,"cache":1765,"hit":1766,"kv_transfer_params":1767,"params":1768,"transfer":1769,"multi_modal_placeholders":1770,"forward":1771,"still":1772,"older":1773,"kwargs":1774,"warning_once":1775,"ignoring":1776,"extra":1777,"arguments":1778,"add":1779,"next_output":1780,"aggregate":1781,"next_completion":1782,"enumerate":1783,"break":1784,"classmethod":1785,"from_seq_group":1786,"cls":1787,"seq_group":1788,"use_cache":1789,"seq_id_to_seq_group":1790,"is_finished":1791,"assembled_seq_group":1792,"maybe_assemble_group":1793,"finish_seq":1794,"seq":1795,"to_be_finished":1796,"sub_request_id":1797,"seq_id_to_index":1798,"keys":1799,"del":1800,"parameters":1801,"completionrequest":1802,"output_kind":1803,"final_only":1804,"init":1805,"cached_request_output":1806,"ignore":1807,"top_n_seqs":1808,"get_seqs":1809,"omit":1810,"explicitly":1811,"sampled":1812,"even":1813,"include_logprobs":1814,"text_buffer_length":1815,"output_text_buffer_length":1816,"delta":1817,"include_prompt":1818,"output_text":1819,"get_output_text_to_return":1820,"output_token_ids":1821,"get_output_token_ids_to_return":1822,"num_output_tokens":1823,"get_num_cached_tokens":1824,"output_logprobs":1825,"slice":1826,"applicable":1827,"finishes":1828,"don":1829,"containing":1830,"get_output_len":1831,"cached":1832,"cached_outputs":1833,"get_cumulative_logprob":1834,"get_finished_reason":1835,"finished_time":1836,"set_finished_time":1837,"init_kwargs":1838,"request_output":1839,"_o":1840,"given":1841,"flag":1842,"indicating":1843,"completed":1844,"pooled_data":1845,"dtype":1846,"float32":1847,"device":1848,"requestoutputfactory":1849,"vector":1850,"floats":1851,"length":1852,"dimension":1853,"from_base":1854,"pooling_output":1855,"ndim":1856,"tolist":1857,"property":1858,"hidden_size":1859,"classification":1860,"probs":1861,"shape":1862,"num_classes":1863,"scoring":1864,"score":1865,"similarity":1866,"scalar":1867,"classify":1868,"task":1869,"embed":1870,"squeeze":1871,"item":1872,"intel_extension_for_pytorch":1873,"ipex":1874,"importerror":1875,"msg":1876,"ipex_ops":1877,"_reshape_activation_tensor":1878,"tuple":1879,"num":1880,"reshape":1881,"x1":1882,"x2":1883,"chunk":1884,"chunks":1885,"dim":1886,"silu_and_mul":1887,"gelu_and_mul":1888,"gelu_tanh_and_mul":1889,"gelu_fast":1890,"nn":1891,"gelu":1892,"gelu_new":1893,"gelu_quick":1894,"paged_attention_v1":1895,"query":1896,"key_cache":1897,"value_cache":1898,"num_kv_heads":1899,"block_tables":1900,"context_lens":1901,"block_size":1902,"max_context_len":1903,"alibi_slopes":1904,"kv_cache_dtype":1905,"k_scale":1906,"v_scale":1907,"tp_rank":1908,"blocksparse_local_blocks":1909,"blocksparse_vert_stride":1910,"blocksparse_block_size":1911,"64":1912,"blocksparse_head_sliding_step":1913,"auto":1914,"num_heads":1915,"num_queries_per_tokens":1916,"single_query_kv_attention":1917,"contiguous":1918,"view_as":1919,"paged_attention_v2":1920,"exp_sum":1921,"max_logits":1922,"tmp_out":1923,"rotary_embedding":1924,"positions":1925,"batch_size":1926,"seq_len":1927,"head_size":1928,"cos_sin_cache":1929,"cos_sin_dim":1930,"rot_dim":1931,"is_neox":1932,"rotary_embedding_batched":1933,"batched_rotary_embedding":1934,"cos_sin_cache_offsets":1935,"rms_norm":1936,"weight":1937,"epsilon":1938,"fused_add_rms_norm":1939,"residual":1940,"tmp":1941,"add_rms_norm":1942,"copy_":1943,"varlen_attention":1944,"seqlen_q":1945,"seqlen_k":1946,"max_seqlen_q":1947,"max_seqlen_k":1948,"pdropout":1949,"softmax_scale":1950,"zero_tensors":1951,"is_causal":1952,"return_softmax":1953,"gen_":1954,"generator":1955,"window_size_left":1956,"window_size_right":1957,"logits_soft_cap":1958,"endswith":1959,"reshape_and_cache":1960,"slot_mapping":1961,"reshape_and_cache_flash":1962,"k_scale_float":1963,"v_scale_float":1964,"todo":1965,"kv":1966,"flash_attn_varlen_func":1967,"cu_seqlens_q":1968,"seqused_k":1969,"kernel":1970,"causal":1971,"block_table":1972,"window_size":1973,"softcap":1974,"cu_seqlens_k":1975,"currently":1976,"scheduler_metadata":1977,"fa_version":1978,"q_descale":1979,"k_descale":1980,"v_descale":1981,"num_splits":1982,"s_aux":1983,"cumsum":1984,"int32":1985,"real_window_size":1986,"get_scheduler_metadata":1987,"num_heads_q":1988,"num_heads_kv":1989,"headdim":1990,"cache_seqlens":1991,"qkv_dtype":1992,"bfloat16":1993,"headdim_v":1994,"cu_seqlens_k_new":1995,"cache_leftpad":1996,"page_size":1997,"max_seqlen_k_new":1998,"means":1999,"infinite":2000,"window":2001,"has_softcap":2002,"tuned":2003,"speed":2004,"pack_gqa":2005,"sm_margin":2006,"sms":2007,"implemented":2008,"returning":2009,"copy_blocks":2010,"key_caches":2011,"value_caches":2012,"block_mapping":2013,"swap_blocks":2014,"contextlib":2015,"platforms":2016,"current_platform":2017,"scalar_type":2018,"scalartype":2019,"is_tpu":2020,"is_xpu":2021,"supports_moe_ops":2022,"suppress":2023,"register_fake":2024,"impl_abstract":2025,"page":2026,"ops":2027,"seq_lens":2028,"max_seq_len":2029,"paged_attention_rocm":2030,"query_start_loc":2031,"fp8_out_scale":2032,"paged_attention":2033,"mla_decode_kvcache_cpu":2034,"kv_cache":2035,"_c_cpu":2036,"mla_decode_kvcache":2037,"merge_attn_states":2038,"prefix_output":2039,"prefix_lse":2040,"suffix_output":2041,"suffix_lse":2042,"output_lse":2043,"convert_vertical_slash_indexes":2044,"q_seqlens":2045,"batch":2046,"kv_seqlens":2047,"vertical_indexes":2048,"n_heads":2049,"nnz_v":2050,"slash_indexes":2051,"nnz_s":2052,"context_size":2053,"block_size_m":2054,"block_size_n":2055,"nnz_slash":2056,"nnz_vertical":2057,"num_rows":2058,"block_count":2059,"zeros":2060,"block_offset":2061,"column_count":2062,"column_index":2063,"convert_vertical_slash_indexes_mergehead":2064,"different":2065,"head":2066,"indices":2067,"vertical_indices_count":2068,"slash_indices_count":2069,"pos":2070,"encoding":2071,"layer":2072,"norm":2073,"call":2074,"input_contiguous":2075,"apply_repetition_penalties_torch":2076,"logits":2077,"prompt_mask":2078,"output_mask":2079,"repetition_penalties":2080,"unsqueeze":2081,"repeat":2082,"appears":2083,"op":2084,"penalties":2085,"divide":2086,"penalty":2087,"multiply":2088,"scaling":2089,"apply_repetition_penalties_cuda":2090,"apply_repetition_penalties_":2091,"apply_repetition_penalties":2092,"repetition":2093,"place":2094,"num_seqs":2095,"vocab_size":2096,"boolean":2097,"appear":2098,"is_cuda":2099,"is_contiguous":2100,"fused":2101,"quant":2102,"rms_norm_dynamic_per_token_quant":2103,"quant_dtype":2104,"scale_ub":2105,"empty_like":2106,"scales":2107,"numel":2108,"awq_dequantize":2109,"qweight":2110,"split_k_iters":2111,"thx":2112,"thy":2113,"vllm_use_triton_awq":2114,"awq_triton":2115,"awq_dequantize_triton":2116,"awq_gemm":2117,"qzeros":2118,"awq_gemm_triton":2119,"gptq_gemm":2120,"b_q_weight":2121,"b_gptq_qzeros":2122,"b_gptq_scales":2123,"b_g_idx":2124,"use_exllama":2125,"bit":2126,"hasattr":2127,"_gptq_gemm_fake":2128,"gptq_shuffle":2129,"q_weight":2130,"q_perm":2131,"marlin":2132,"marlin_gemm":2133,"b_scales":2134,"workspace":2135,"size_m":2136,"size_n":2137,"size_k":2138,"marlin_24":2139,"gptq_marlin_24_gemm":2140,"b_meta":2141,"b_q_type":2142,"_gptq_marlin_24_gemm_fake":2143,"symint":2144,"gptq_marlin_gemm":2145,"_gptq_marlin_gemm_fake":2146,"b_bias":2147,"global_scale":2148,"b_zeros":2149,"g_idx":2150,"perm":2151,"b_q_type_id":2152,"is_k_full":2153,"use_atomic_add":2154,"use_fp32_reduce":2155,"is_zp_float":2156,"marlin_qqq_gemm":2157,"_marlin_qqq_gemm_fake":2158,"s_tok":2159,"s_ch":2160,"s_group":2161,"float16":2162,"_marlin_gemm_fake":2163,"_awq_dequantize_fake":2164,"in_c":2165,"qout_c":2166,"out_c":2167,"_awq_gemm_fake":2168,"num_in_feats":2169,"sum":2170,"machete_mm":2171,"machete_mm_fake":2172,"b_q":2173,"returned":2174,"machete_prepack_b":2175,"b_type":2176,"out_type":2177,"b_group_scales":2178,"b_group_zeros":2179,"b_group_size":2180,"b_channel_scales":2181,"a_token_scales":2182,"schedule":2183,"machete_prepack_b_fake":2184,"a_type":2185,"group_scales_type":2186,"memory_format":2187,"contiguous_format":2188,"allspark_w8a16_gemm":2189,"_allspark_w8a16_gemm_fake":2190,"b_qweight":2191,"b_qzeros":2192,"group_size":2193,"sm_count":2194,"sm_version":2195,"cublas_m_threshold":2196,"has_zp":2197,"n32k16_reorder":2198,"ggml_dequantize":2199,"_ggml_dequantize_fake":2200,"quant_type":2201,"ggml_mul_mat_vec_a8":2202,"_ggml_mul_mat_vec_a8_fake":2203,"row":2204,"ggml_mul_mat_a8":2205,"_ggml_mul_mat_a8_fake":2206,"ggml_moe_a8":2207,"_ggml_moe_a8_fake":2208,"sorted_token_ids":2209,"expert_ids":2210,"num_tokens_post_padded":2211,"top_k":2212,"ggml_moe_a8_vec":2213,"_ggml_moe_a8_vec_fake":2214,"topk_ids":2215,"cutlass":2216,"cutlass_scaled_mm_supports_fp4":2217,"cuda_device_capability":2218,"cutlass_blockwise_scaled_grouped_mm":2219,"scales_a":2220,"scales_b":2221,"problem_sizes":2222,"expert_offsets":2223,"cutlass_scaled_fp4_mm":2224,"block_scale_a":2225,"block_scale_b":2226,"out_dtype":2227,"cutlass_scaled_mm_supports_fp8":2228,"cutlass_scaled_mm_supports_block_fp8":2229,"cutlass_scaled_mm":2230,"scale_a":2231,"scale_b":2232,"bias":2233,"implements":2234,"mm":2235,"numpy":2236,"style":2237,"broadcasting":2238,"blockwise":2239,"found":2240,"extended":2241,"broadcast":2242,"rules":2243,"rule":2244,"extent":2245,"element":2246,"along":2247,"src_shape":2248,"target_shape":2249,"times":2250,"consecutively":2251,"expand":2252,"128":2253,"massage":2254,"2d":2255,"cutlass_compatible_b":2256,"is_rocm":2257,"compressed_tensors":2258,"triton_scaled_mm":2259,"cutlass_scaled_mm_azp":2260,"azp_adj":2261,"azp":2262,"param":2263,"cutlass_sparse_scaled_mm_supported":2264,"cutlass_group_gemm_supported":2265,"cutlass_sparse_compress":2266,"compresses":2267,"sparse":2268,"matrix":2269,"operations":2270,"takes":2271,"dense":2272,"two":2273,"elements":2274,"compressed":2275,"representation":2276,"must":2277,"types":2278,"float8_e4m3fn":2279,"a_nzs":2280,"a_meta":2281,"raises":2282,"compression":2283,"operation":2284,"fails":2285,"uint8":2286,"encodes":2287,"sparsity":2288,"elemspermetaelem":2289,"dimensions":2290,"8b":2291,"2b_per_nz":2292,"cutlass_scaled_sparse_mm":2293,"bt_nzs":2294,"bt_meta":2295,"performs":2296,"scaled":2297,"multiplication":2298,"steps":2299,"randn":2300,"prune":2301,"prune_to_2_4":2302,"compress":2303,"transposed":2304,"applying":2305,"factors":2306,"result":2307,"get_cutlass_moe_mm_data":2308,"problem_sizes1":2309,"problem_sizes2":2310,"input_permutation":2311,"output_permutation":2312,"num_experts":2313,"blockscale_offsets":2314,"prepare":2315,"necessary":2316,"grouped":2317,"multiplications":2318,"moe":2319,"mapping":2320,"mark":2321,"begins":2322,"computation":2323,"sorted":2324,"computed":2325,"mxnxk":2326,"sizes":2327,"mms":2328,"permutation":2329,"shuffle":2330,"executing":2331,"argument":2332,"passed":2333,"fp4":2334,"block":2335,"rows":2336,"shuffle_rows":2337,"input_tensor":2338,"dst2src_map":2339,"according":2340,"store":2341,"output_tensor":2342,"permute":2343,"performing":2344,"num_tokens_permuted":2345,"get_cutlass_pplx_moe_mm_data":2346,"expert_num_tokens":2347,"num_local_experts":2348,"padded_m":2349,"non_zero_expert_idxs":2350,"consecutive":2351,"experts":2352,"counts":2353,"cutlass_moe_mm":2354,"out_tensors":2355,"a_tensors":2356,"b_tensors":2357,"a_scales":2358,"a_strides":2359,"b_strides":2360,"c_strides":2361,"per_act_token":2362,"per_out_ch":2363,"executes":2364,"quantized":2365,"ab":2366,"strides":2367,"cutlass_fp4_moe_mm":2368,"alphas":2369,"sf_offsets":2370,"blockscaled":2371,"gemm":2372,"runs":2373,"gemms":2374,"combination":2375,"problem":2376,"nvfp4":2377,"fusedmoe":2378,"a_ptrs":2379,"b_ptrs":2380,"tensors":2381,"weights":2382,"a_":2383,"blockscales":2384,"e4m3":2385,"precision":2386,"sf_size":2387,"sf_offset":2388,"cutlass_fp4_group_mm":2389,"gptq_marlin":2390,"gptq_marlin_repack":2391,"num_bits":2392,"awq_marlin_repack":2393,"gptq_marlin_moe_repack":2394,"awq_marlin_moe_repack":2395,"machete":2396,"machete_supported_schedules":2397,"group_zeros_type":2398,"channel_scales_type":2399,"token_scales_type":2400,"permute_cols":2401,"_permute_cols_fake":2402,"scaled_fp4_quant":2403,"input_global_scale":2404,"quantize":2405,"quantizes":2406,"last":2407,"dynamically":2408,"factor":2409,"shared":2410,"stored":2411,"swizzled":2412,"layout":2413,"thread":2414,"tcgen05":2415,"mma":2416,"4x":2417,"entire":2418,"values":2419,"packed":2420,"float8_e4m3":2421,"sizzled":2422,"needs":2423,"got":2424,"other_dims":2425,"fp16":2426,"bf16":2427,"rounded":2428,"requirement":2429,"minimum":2430,"tile":2431,"128x4":2432,"pad":2433,"multiples":2434,"round_up":2435,"rounded_m":2436,"scale_n":2437,"rounded_n":2438,"output_scale":2439,"scaled_fp4_experts_quant":2440,"topk":2441,"offsets":2442,"blockscale":2443,"output_scales":2444,"maximum":2445,"prevent":2446,"running":2447,"increased":2448,"larger":2449,"max_tokens_per_expert":2450,"vllm_max_tokens_per_expert_fp4_moe":2451,"m_numtopk":2452,"cutlass_moe_fp4":2453,"observed":2454,"scales_k":2455,"padded_k":2456,"scaled_fp8_quant":2457,"num_token_padding":2458,"use_per_token_if_dynamic":2459,"dynamic":2460,"provide":2461,"determined":2462,"padding":2463,"downstream":2464,"benefit":2465,"upper":2466,"bound":2467,"least":2468,"per_tensor":2469,"per_token":2470,"assumes":2471,"batch_dim":2472,"num_tokens":2473,"flattened":2474,"mi300":2475,"float_e3m3fnuz":2476,"fp8_dtype":2477,"dynamic_per_token_scaled_fp8_quant":2478,"dynamic_scaled_fp8_quant":2479,"static_scaled_fp8_quant":2480,"allspark":2481,"allspark_repack_weight":2482,"zero_point":2483,"rearrange":2484,"asymmetric":2485,"n32k16":2486,"ampere":2487,"w8a16":2488,"original":2489,"provided":2490,"symmetric":2491,"rearranged":2492,"n_32align":2493,"32":2494,"qweight_reorder":2495,"scale_reorder":2496,"zero_point_reorder":2497,"rearrange_kn_weight_as_n32k16_order":2498,"scaled_int8_quant":2499,"maybe":2500,"invoke":2501,"point":2502,"ignored":2503,"static_scaled_int8_quant":2504,"input_scales":2505,"input_azp":2506,"dynamic_scaled_int8_quant":2507,"qqq":2508,"gguf":2509,"ggml_moe_get_block_size":2510,"mamba":2511,"selective_scan_fwd":2512,"d_":2513,"z_":2514,"delta_bias_":2515,"delta_softplus":2516,"cache_indices":2517,"has_initial_state":2518,"ssm_states":2519,"pad_slot_id":2520,"skinny":2521,"llmm1":2522,"rows_per_block":2523,"wvsplitk":2524,"cu_count":2525,"wvsplitkq":2526,"moe_sum":2527,"moe_align_block_size":2528,"experts_ids":2529,"num_tokens_post_pad":2530,"moe_wna16_gemm":2531,"topk_weights":2532,"block_size_k":2533,"notimplementederror":2534,"topk_softmax":2535,"token_expert_indices":2536,"gating_output":2537,"moe_wna16_marlin_gemm":2538,"num_tokens_past_padded":2539,"moe_block_size":2540,"mul_topk_weights":2541,"is_ep":2542,"marlin_gemm_moe":2543,"marlin_gemm_moe_fake":2544,"b_q_weights":2545,"sorted_ids":2546,"b_zero_points":2547,"replicate_input":2548,"apply_weights":2549,"moe_wna16_marlin_gemm_fake":2550,"_c_cache_ops":2551,"concat_and_cache_mla":2552,"kv_c":2553,"k_pe":2554,"copy_blocks_mla":2555,"kv_caches":2556,"convert_fp8":2557,"kv_dtype":2558,"gather_cache":2559,"src_cache":2560,"cu_seq_lens":2561,"seq_starts":2562,"get_device_attribute":2563,"_c_cuda_utils":2564,"get_max_shared_memory_per_block_device_attribute":2565,"ruff":2566,"e501":2567,"custom":2568,"ar":2569,"init_custom_ar":2570,"ipc_tensors":2571,"rank_data":2572,"rank":2573,"fully_connected":2574,"_c_custom_ar":2575,"all_reduce":2576,"fa":2577,"inp":2578,"reg_buffer":2579,"reg_buffer_sz_bytes":2580,"dispose":2581,"meta_size":2582,"register_buffer":2583,"get_graph_buffer_ipc_meta":2584,"register_graph_buffers":2585,"handles":2586,"allocate_shared_buffer_and_handle":2587,"open_mem_handle":2588,"mem_handle":2589,"free_shared_buffer":2590,"ptr":2591,"quick":2592,"init_custom_qr":2593,"world_size":2594,"qr_max_size":2595,"qr_destroy":2596,"qr_all_reduce":2597,"quant_level":2598,"cast_bf2half":2599,"qr_get_handle":2600,"qr_open_handles":2601,"get_flash_mla_metadata":2602,"num_heads_per_head_k":2603,"num_heads_k":2604,"equals":2605,"seq_len_q":2606,"tile_scheduler_metadata":2607,"num_sm_parts":2608,"tileschedulermetadatasize":2609,"flash_mla_with_kvcache":2610,"k_cache":2611,"head_dim_v":2612,"head_dim":2613,"num_blocks":2614,"page_block_size":2615,"max_num_blocks_per_seq":2616,"get_mla_metadata":2617,"qk":2618,"softmax":2619,"sqrt":2620,"mask":2621,"softmax_lse":2622,"flash_mla_fwd_kvcache":2623,"cutlass_mla_decode":2624,"q_nope":2625,"q_pe":2626,"kv_c_and_k_pe_cache":2627,"page_table":2628,"sm100_cutlass_mla_decode":2629,"num_kv_splits":2630,"sm100_cutlass_mla_get_workspace_size":2631,"num_batches":2632,"weight_packed_linear":2633,"weight_packed_linear_fake":2634,"mat1":2635,"mat2":2636,"is_vnni":2637,"fused_experts_cpu":2638,"fused_experts_cpu_fake":2639,"hidden_states":2640,"w1":2641,"w2":2642,"inplace":2643,"use_int8_w8a8":2644,"use_fp8_w8a16":2645,"w1_scale":2646,"w2_scale":2647,"a1_scale":2648,"a2_scale":2649,"int8_scaled_mm_with_quant":2650,"int8_scaled_mm_with_quant_fake":2651,"scales2":2652,"deepcopy":2653,"msgspec":2654,"tasks":2655,"poolingtask":2656,"config":2657,"modelconfig":2658,"struct":2659,"omit_defaults":2660,"arg":2661,"array_like":2662,"attributes":2663,"normalize":2664,"embeddings":2665,"matryoshka":2666,"activation":2667,"reward":2668,"step_tag_id":2669,"returned_token_ids":2670,"internal":2671,"requires_token_ids":2672,"extra_kwargs":2673,"all_parameters":2674,"valid_parameters":2675,"encode":2676,"clone":2677,"deep":2678,"instance":2679,"model_config":2680,"overwrite":2681,"method":2682,"_merge_default_parameters":2683,"_set_default_parameters":2684,"_verify_valid_parameters":2685,"pooler_config":2686,"setattr":2687,"is_matryoshka":2688,"served_model_name":2689,"changing":2690,"poor":2691,"mds":2692,"matryoshka_dimensions":2693,"greater":2694,"invalid_parameters":2695,"__post_init__":2696,"hashlib":2697,"vllm_host_ip":2698,"vllm_port":2699,"vllm_rpc_base_path":2700,"gettempdir":2701,"vllm_use_modelscope":2702,"vllm_ringbuffer_warning_interval":2703,"60":2704,"vllm_nccl_so_path":2705,"ld_library_path":2706,"vllm_use_triton_flash_attn":2707,"vllm_v1_use_prefill_decode_attention":2708,"vllm_use_aiter_unified_attention":2709,"vllm_flash_attn_version":2710,"local_rank":2711,"cuda_visible_devices":2712,"vllm_engine_iteration_timeout_s":2713,"vllm_api_key":2714,"s3_access_key_id":2715,"s3_secret_access_key":2716,"s3_endpoint_url":2717,"vllm_model_redirect_path":2718,"vllm_cache_root":2719,"expanduser":2720,"vllm_config_root":2721,"vllm_usage_stats_server":2722,"stats":2723,"vllm_no_usage_stats":2724,"vllm_do_not_track":2725,"vllm_usage_source":2726,"vllm_configure_logging":2727,"vllm_logging_level":2728,"vllm_logging_prefix":2729,"vllm_logging_config_path":2730,"vllm_logits_processor_threads":2731,"vllm_log_stats_interval":2732,"vllm_trace_function":2733,"vllm_attention_backend":2734,"vllm_use_flashinfer_sampler":2735,"vllm_flashinfer_force_tensor_cores":2736,"vllm_pp_layer_partition":2737,"vllm_cpu_kvcache_space":2738,"vllm_cpu_omp_threads_bind":2739,"vllm_cpu_num_of_reserved_cpu":2740,"vllm_cpu_moe_prepack":2741,"vllm_cpu_sgl_kernel":2742,"vllm_xla_cache_path":2743,"xla_cache":2744,"vllm_xla_check_recompilation":2745,"vllm_fused_moe_chunk_size":2746,"1024":2747,"vllm_enable_fused_moe_activation_chunking":2748,"vllm_use_ray_spmd_worker":2749,"vllm_use_ray_compiled_dag":2750,"vllm_use_ray_compiled_dag_channel_type":2751,"vllm_use_ray_compiled_dag_overlap_comm":2752,"vllm_use_ray_wrapped_pp_comm":2753,"vllm_xla_use_spmd":2754,"vllm_worker_multiproc_method":2755,"fork":2756,"vllm_assets_cache":2757,"vllm_image_fetch_timeout":2758,"vllm_video_fetch_timeout":2759,"vllm_audio_fetch_timeout":2760,"vllm_media_loading_thread_count":2761,"vllm_max_audio_clip_filesize_mb":2762,"25":2763,"vllm_video_loader_backend":2764,"opencv":2765,"vllm_mm_input_cache_gib":2766,"vllm_keep_alive_on_engine_death":2767,"vllm_allow_long_max_model_len":2768,"vllm_rpc_timeout":2769,"10000":2770,"ms":2771,"vllm_http_timeout_keep_alive":2772,"seconds":2773,"vllm_plugins":2774,"vllm_lora_resolver_cache_dir":2775,"vllm_torch_profiler_dir":2776,"vllm_torch_profiler_record_shapes":2777,"vllm_torch_profiler_with_profile_memory":2778,"vllm_torch_profiler_with_stack":2779,"vllm_torch_profiler_with_flops":2780,"vllm_allow_runtime_lora_updating":2781,"vllm_skip_p2p_check":2782,"vllm_disabled_kernels":2783,"vllm_use_v1":2784,"vllm_rocm_use_aiter":2785,"vllm_rocm_use_aiter_paged_attn":2786,"vllm_rocm_use_aiter_linear":2787,"vllm_rocm_use_aiter_moe":2788,"vllm_rocm_use_aiter_rmsnorm":2789,"vllm_rocm_use_aiter_mla":2790,"vllm_rocm_use_aiter_mha":2791,"vllm_rocm_use_skinny_gemm":2792,"vllm_rocm_fp8_padding":2793,"vllm_rocm_moe_padding":2794,"vllm_rocm_custom_paged_attn":2795,"vllm_enable_v1_multiprocessing":2796,"vllm_log_batchsize_interval":2797,"vllm_disable_compile_cache":2798,"q_scale_constant":2799,"k_scale_constant":2800,"v_scale_constant":2801,"100":2802,"vllm_server_dev_mode":2803,"vllm_v1_output_proc_chunk_size":2804,"vllm_mla_disable":2805,"vllm_ray_per_worker_gpus":2806,"vllm_ray_bundle_indices":2807,"vllm_cudart_so_path":2808,"vllm_dp_rank":2809,"vllm_dp_rank_local":2810,"vllm_dp_size":2811,"vllm_dp_master_ip":2812,"vllm_dp_master_port":2813,"vllm_moe_dp_chunk_size":2814,"256":2815,"vllm_randomize_dp_dummy_inputs":2816,"vllm_marlin_use_atomic_add":2817,"vllm_mxfp4_use_marlin":2818,"vllm_v0_use_outlines_cache":2819,"vllm_v1_use_outlines_cache":2820,"vllm_tpu_bucket_padding_gap":2821,"vllm_tpu_most_model_len":2822,"vllm_tpu_using_pathways":2823,"vllm_use_deep_gemm":2824,"vllm_use_deep_gemm_e8m0":2825,"vllm_skip_deep_gemm_warmup":2826,"vllm_use_flashinfer_moe_fp8":2827,"vllm_use_flashinfer_moe_fp4":2828,"vllm_flashinfer_moe_backend":2829,"vllm_xgrammar_cache_mb":2830,"vllm_msgpack_zero_copy_threshold":2831,"vllm_allow_insecure_serialization":2832,"vllm_nixl_side_channel_host":2833,"localhost":2834,"vllm_nixl_side_channel_port":2835,"5557":2836,"vllm_all2all_backend":2837,"naive":2838,"163840":2839,"vllm_tool_parse_regex_timeout_seconds":2840,"vllm_sleep_when_idle":2841,"vllm_mq_max_chunk_bytes_mb":2842,"vllm_execute_model_timeout_seconds":2843,"300":2844,"vllm_kv_cache_layout":2845,"vllm_compute_nans_in_logits":2846,"vllm_use_nvfp4_ct_emulations":2847,"vllm_rocm_quick_reduce_quantization":2848,"vllm_rocm_quick_reduce_cast_bf16_to_fp16":2849,"vllm_rocm_quick_reduce_max_size_bytes_mb":2850,"vllm_nixl_abort_request_timeout":2851,"120":2852,"vllm_use_cudnn_prefill":2853,"vllm_enable_cudagraph_gc":2854,"vllm_loopback_ip":2855,"vllm_allow_chunked_local_attn_with_hybrid_kv_cache":2856,"vllm_enable_responses_api_store":2857,"vllm_use_trtllm_attention":2858,"vllm_use_flashinfer_moe_mxfp4_mxfp8":2859,"vllm_use_flashinfer_moe_mxfp4_bf16":2860,"vllm_tuned_config_folder":2861,"get_default_cache_root":2862,"xdg_cache_home":2863,"get_default_config_root":2864,"xdg_config_home":2865,"maybe_convert_int":2866,